#include <iostream>

#include "segment3d.h"

#include <cmath>

using namespace std;

//#include <vector>
//vector <int> vi;
//printvec<>

// Создание вектора

// Сложение двух векторов

// Вычитание двух векторов

// Проверка равенства двух векторов

// Проверка неравенства двух векторов

// Скалярное произведение двух векторов

// Умножение вектора на число

// Вычисление длины вектора

// Нормирование вектора

// Векторное произведение двух векторов

// Перегрузка оператора << для вывода
// Вектор должен выводиться в виде {X, Y, Z}



